MoonModules/projectMM/src/platform/esp32/platform_config.h
#pragma once

// ESP32 platform configuration: PSRAM detected via sdkconfig

#include "sdkconfig.h"

#include <cstdint>

// The RMT TX-channel count moved into the RMT HAL's low-level header when the
// RMT HAL graduated into its own `esp_hal_rmt` component on the v6.1 line (the
// header re-appears at `hal/rmt_ll.h`, now shipped by `esp_hal_rmt` instead of
// the monolithic `hal` component). Espressif also removed the public
// `SOC_RMT_TX_CANDIDATES_PER_GROUP` soc-cap from `soc/soc_caps.h` in the same
// pass, so the LL symbol is the only per-target definition of the count on
// beta1. Included at file scope (not inside the namespace) so the standard
// headers it pulls land in `::`, and only on RMT-bearing builds.
#ifdef CONFIG_SOC_RMT_SUPPORTED
#include "hal/rmt_ll.h"
#endif

// MM_RAMFUNC: "this function executes from RAM, not flash" (the __ramfunc concept from STM32/Zephyr,
// spelled IRAM_ATTR in ESP-IDF). For code an ISR runs on a tight deadline: flash-resident code shares
// one instruction cache between both cores, so a hot render loop evicts an ISR's code path between
// invocations and every firing pays flash-refetch latency. A macro (not if constexpr) because it is a
// function ATTRIBUTE; defined per-platform here behind the platform boundary, empty on desktop.
#include "esp_attr.h"
#define MM_RAMFUNC IRAM_ATTR

namespace mm::platform {

#ifdef CONFIG_SPIRAM
constexpr bool hasPsram = true;
#else
constexpr bool hasPsram = false;
#endif

// Which ESP32 silicon family this build targets. Capability gating
// (rmtTxChannels, lcdLanes, parlioLanes, hasI2sMic) keys off SOC flags, not the
// family, so most new chips work untouched without a per-chip flag. Only two chips
// earn an `is<Chip>` flag, for seams that aren't SOC-derived: isEsp32P4 (its
// Ethernet pin defaults in `ethConfigDefault` + co-processor WiFi via
// hasWifiCoprocessor) and isEsp32S3 (its W5500-SPI Ethernet default: see below).
// Keyed off the IDF target macro; false on desktop.
#ifdef CONFIG_IDF_TARGET_ESP32P4
constexpr bool isEsp32P4 = true;
#else
constexpr bool isEsp32P4 = false;
#endif

// isEsp32S3 earns its place the same way isEsp32P4 does: a chip-specific seam not
// derivable from a SOC flag: the S3 has no internal EMAC, so its Ethernet default
// is W5500-over-SPI (where classic/P4 default to RMII). Used only for ethConfigDefault.
#ifdef CONFIG_IDF_TARGET_ESP32S3
constexpr bool isEsp32S3 = true;
#else
constexpr bool isEsp32S3 = false;
#endif

// isEsp32S31: the S31 is the only target whose EMAC is RGMII / 1 Gb (SOC_EMAC_SUPPORT_1000M),
// where classic/P4 are RMII: so its Ethernet default is a distinct RGMII PHY (YT8531) with a
// different pin set. Not derivable from a SOC flag (the RGMII data pins are board wiring, not a
// chip property). Used by ethConfigDefault and ethInitEmac's RGMII branch/log.
#ifdef CONFIG_IDF_TARGET_ESP32S31
constexpr bool isEsp32S31 = true;
#else
constexpr bool isEsp32S31 = false;
#endif

// The RGMII data bus: the fixed IO_MUX pads the EMAC accepts for TXD0-3 / RXD0-3 / TX_CTL / RX_CTL
// and the two clocks. They are silicon's choice, not board wiring and not user config, which is why
// ethInitEmac() hands exactly these to the driver. Declared here so ONE list serves both that init and
// NetworkModule's read-only pin controls: the controls are the pin registry the pin map reads, and a
// pad nobody declares is a pad the map shows free while the MAC drives it (an LED lane parked on
// GPIO 10 corrupted every frame the MAC sent, with the link still reporting 1000 Mbit and no drops).
/// One pad the EMAC's data interface owns: the signal it carries and the GPIO the silicon fixed it
/// to. RGMII on the S31, RMII on the P4, and neither is configurable, which is why they are reported
/// through MoonModule::fixedPins() rather than published as controls. Pairing name with GPIO here is
/// what keeps the MAC's wiring and the pin map's label from drifting apart: both read this list.
struct EthFixedPad { const char* name; uint8_t gpio; };
#ifdef CONFIG_IDF_TARGET_ESP32S31
constexpr EthFixedPad ethFixedPads[] = {
    {"ethTxd0",  8}, {"ethTxd1",  9}, {"ethTxd2", 10}, {"ethTxd3", 11},
    {"ethTxCtl", 12}, {"ethTxClk", 13}, {"ethRxClk", 14}, {"ethRxCtl", 15},
    {"ethRxd3", 16}, {"ethRxd2", 17}, {"ethRxd1", 18}, {"ethRxd0", 19},
};
constexpr uint8_t ethFixedPadCount = 12;
#elif defined(CONFIG_IDF_TARGET_ESP32P4)
// P4 RMII: the data lines the EMAC drives, from ETH_ESP32_EMAC_DEFAULT_CONFIG() (which ethInitEmac
// leaves untouched) and matching the NANO wiring in docs/reference/gpio-usage.md. Not the management
// pair, which NetworkModule owns as real controls a carrier can reroute.
constexpr EthFixedPad ethFixedPads[] = {
    {"ethTxEn", 49}, {"ethTxd0", 34}, {"ethTxd1", 35},
    {"ethCrsDv", 28}, {"ethRxd0", 29}, {"ethRxd1", 30},
};
constexpr uint8_t ethFixedPadCount = 6;
#elif defined(CONFIG_IDF_TARGET_ESP32)
// Classic ESP32 RMII: one IO_MUX choice per signal, so these are the pins, not a default. From the
// IDF's own RMII Data Plane GPIO table (docs/en/api-reference/network/esp_eth.rst), which is why
// ethInitEmac does not set them: there is nothing to choose. The management pair (MDC/MDIO) IS
// routable through the GPIO matrix and stays a NetworkModule control.
constexpr EthFixedPad ethFixedPads[] = {
    {"ethTxEn", 21}, {"ethTxd0", 19}, {"ethTxd1", 22},
    {"ethCrsDv", 27}, {"ethRxd0", 25}, {"ethRxd1", 26},
};
constexpr uint8_t ethFixedPadCount = 6;
#endif
#if defined(CONFIG_IDF_TARGET_ESP32S31) || defined(CONFIG_IDF_TARGET_ESP32P4) || defined(CONFIG_IDF_TARGET_ESP32)
// MoonLive emits native code per ISA (moonlive_emit_xtensa.cpp / moonlive_emit_riscv.cpp, and the
// assemblers beside them). Every ESP32 is one or the other, so a third is an unfinished port rather
// than a configuration: fail the build here instead of shipping a device whose scripts run dark.
#if !defined(__XTENSA__) && !defined(__riscv)
#error "MoonLive ESP32 backend: unsupported ISA (expected Xtensa or RISC-V)"
#endif

static_assert(ethFixedPadCount == sizeof(ethFixedPads) / sizeof(ethFixedPads[0]),
              "the count gates every loop over this list: a mismatch reads past the end");
#else
// RMII targets name their data pins through NetworkModule's own controls, so there is no fixed pad
// to publish. A one-element dummy rather than a zero-size array: `T x[] = {}` is a GCC/Clang
// extension that MSVC refuses, and the desktop build is compiled by MSVC on the Windows CI job.
constexpr EthFixedPad ethFixedPads[] = {{"", 0}};
constexpr uint8_t ethFixedPadCount = 0;
#endif

// RMT TX channels this chip offers (8 on classic ESP32, 4 on the S3 / P4 / S31,
// straight from the RMT HAL: `RMT_LL_TX_CANDIDATES_PER_INST`, included above).
// Doubles as the RMT capability flag: the RMT LED driver and its main.cpp
// registration guard on `rmtTxChannels > 0` instead of a chip-family flag, so a
// new RMT-bearing target works untouched.
#ifdef CONFIG_SOC_RMT_SUPPORTED
constexpr uint8_t rmtTxChannels = RMT_LL_TX_CANDIDATES_PER_INST;
#else
constexpr uint8_t rmtTxChannels = 0;
#endif

