MoonModules/projectMM/src/platform/esp32/platform_config.h
// Parallel WS2812 lanes over the LCD_CAM i80 bus (ESP32-S3 / P4). The peripheral
// does 16 data lines and the driver uses all of them: it derives the actual bus
// width (8 or 16: power-of-two only) from the configured pin count, so this is
// the ceiling, not a self-imposed cap. SOC-derived like rmtTxChannels so a future
// LCD_CAM-bearing chip works untouched.
//
// Gate on SOC_LCDCAM_I80_LCD_SUPPORTED (the LCD_CAM peripheral's i80 mode),
// NOT SOC_LCD_I80_SUPPORTED: the classic ESP32 sets the latter for its
// unrelated I2S-LCD peripheral, so gating on it wired this driver onto the
// classic chip and hung its boot trying to init an esp_lcd i80 bus the chip
// doesn't have. SOC_LCDCAM_I80_LCD_SUPPORTED is defined only on chips with the
// real LCD_CAM (S3/P4/S31), which is what esp_lcd's i80 driver actually needs.
// The LCD_CAM i80 bus does 16 data lines. The driver derives the actual bus width
// (8 or 16: power-of-two only) from the configured pin count; this is the MAX it
// may reach. LCD requires exactly 8 or 16 real pins (i80 rejects an NC data line).
#ifdef CONFIG_SOC_LCDCAM_I80_LCD_SUPPORTED
constexpr uint8_t lcdLanes = 16;
#else
constexpr uint8_t lcdLanes = 0;
#endif

// hasLcdCam: is this LCD_CAM silicon (S3/P4/S31)? Separate from the lane COUNT because the host
// sets a non-zero count so the parallel driver RUNS there against a memory bus, while having no
// LCD_CAM at all. On a real chip the two coincide; the pin expander keys off the capability.
constexpr bool hasLcdCam = (lcdLanes > 0);

// Parallel WS2812 lanes over the Parlio (Parallel IO) TX peripheral: the
// ESP32-P4's scale path. The unit does 16 data lines; the driver derives the bus
// width (8 or 16) from the pin count. SOC-derived like the others, so a future
// Parlio-bearing chip works untouched. Unlike i80, Parlio takes the data GPIOs
// directly (no sacrificial WR/DC) and accepts an NC unused lane, so it runs any
// 1..16 count with no exactly-8-or-16 rule.
#ifdef CONFIG_SOC_PARLIO_SUPPORTED
constexpr uint8_t parlioLanes = 16;
#else
constexpr uint8_t parlioLanes = 0;
#endif

// Parallel WS2812 lanes over the classic ESP32's I2S peripheral in LCD/i80 mode: the
// classic chip's ONLY >8-lane route (it has neither LCD_CAM nor Parlio). IDF's esp_lcd
// component backs the SAME esp_lcd i80 API (esp_lcd_new_i80_bus / tx_color, 8-or-16 bus
// width, WR/DC) with the I2S peripheral on the classic ESP32 (esp_lcd_panel_io_i2s.c),
// using WHOLE-FRAME chained DMA: so MultiPinLedDriver reuses the MultiPinLedDriver code path and
// the i80Ws2812* seam, not a bespoke ISR ring. Gate CLASSIC-ONLY: SOC_LCD_I80_SUPPORTED
// is set on the classic chip (I2S backend) AND the LCD_CAM chips (S3/P4/S31, LCD_CAM backend), so
// exclude the LCD_CAM chips: otherwise both this and lcdLanes would be non-zero on those chips and
// the chip would register both drivers. The `defined(A) && !defined(B)` shape mirrors
// hasEthW5500 below. The i80 bus does 16 data lines; the driver derives 8 or 16 from the
// pin count and requires exactly that many real pins (i80 rejects an NC data line).
#if defined(CONFIG_SOC_LCD_I80_SUPPORTED) && !defined(CONFIG_SOC_LCDCAM_I80_LCD_SUPPORTED)
constexpr uint8_t i2sLanes = 16;
#else
constexpr uint8_t i2sLanes = 0;
#endif

// I2S audio input (an INMP441-class digital MEMS microphone). SOC-derived like
// the LED-peripheral flags: every current ESP32 has I2S, so this is true on all
// of them, but the gate keeps AudioService + the I2S platform seam inert on any
// future I2S-less target and on desktop. The audio math (RMS, FFT bands) is
// host-tested domain code; only the I2S read and the FFT kernel sit behind the
// boundary, both guarded by `if constexpr (platform::hasI2sMic)`.
#ifdef CONFIG_SOC_I2S_SUPPORTED
constexpr bool hasI2sMic = true;
#else
constexpr bool hasI2sMic = false;
#endif

// OS capture devices are a desktop concept; boards use the pin-wired I2S mic above.
constexpr bool hasAudioCapture = false;


// Some boards put the mic behind an I2S audio codec configured over I2C (vs a
// direct I2S MEMS mic). The codec type + its control pins are a fixed board
// property, so they live here per-target (like ethConfigDefault), not as
// AudioService controls: the I2S data pins (ws/sd/sck) stay user controls.
// `audioCodecInit` (platform.h) consumes these; CodecType is neutral so a second
// codec is just another enum value + a backend branch.
enum class CodecType : uint8_t { None = 0, Es8311 = 1 };
struct AudioCodecPins {
    uint16_t i2cSda;
    uint16_t i2cScl;
    uint16_t mclk;      // I2S master clock the codec needs (separate from BCLK/WS)
    uint8_t  i2cAddr;   // codec I2C address (ES8311 default 0x18)
};

// Default None; the ESP32-S31 Function-CoreBoard has an ES8311 (addr 0x18, I2C
// SDA on GPIO51 / SCL on GPIO50, MCLK on GPIO52: bench-confirmed by I2C scan; the
// schematic net labels read SDA/SCL the other way round. See
// docs/reference/esp32-s31-coreboard.md.).
#ifdef CONFIG_IDF_TARGET_ESP32S31
constexpr CodecType audioCodecType = CodecType::Es8311;
constexpr AudioCodecPins audioCodecPins = { /*sda*/ 51, /*scl*/ 50, /*mclk*/ 52, /*addr*/ 0x18 };
#else
constexpr CodecType audioCodecType = CodecType::None;
constexpr AudioCodecPins audioCodecPins = { 0, 0, 0, 0 };
#endif

// WiFi is compiled out in the Ethernet-only build profile. ESP-IDF v6.x has no
// CONFIG_ESP_WIFI_ENABLED switch, so the eth-only build instead drops the WiFi
// components via EXCLUDE_COMPONENTS and defines MM_NO_WIFI (see esp32/main/CMakeLists.txt).
#ifdef MM_NO_WIFI
constexpr bool hasWiFi = false;
#else
constexpr bool hasWiFi = true;
#endif

// The P4 has no native radio; when it has WiFi at all (the esp32p4-eth-wifi build),
// that WiFi runs on the on-board ESP32-C6 over SDIO via esp_wifi_remote / esp_hosted.
// The esp_wifi_* API is identical to native and esp_hosted self-initializes at boot,
// so the WiFi *path* needs no branch. This flag exists only so the co-processor
// firmware read-out (SystemModule's `wifiCoproc` control + platform::coprocessorWifi)
// compiles in ONLY on a build that actually has a co-processor: on every other
// target the buffer, the calls, and the control vanish (if constexpr), keeping the
// flash/RAM cost off boards that can't use it.
constexpr bool hasWifiCoprocessor = isEsp32P4 && hasWiFi;

// Ethernet is only available on firmware variants whose sdkconfig fragment
// enables the ESP32 EMAC (sdkconfig.defaults.eth: the default LAN8720 RMII pin map). Other
// firmwares (plain ESP32 WiFi-only, ESP32-S3 with no EMAC) define MM_NO_ETH
// and get stubbed-out platform::eth* functions, mirroring the desktop layer.
#ifdef MM_NO_ETH
constexpr bool hasEthernet = false;
#else
constexpr bool hasEthernet = true;
#endif

// True when the firmware carries an IP stack at all: WiFi OR Ethernet. UdpSocket
// (lwIP BSD sockets) is present whenever either is, so features that only need
// "some network" (WLED audio sync, any UDP interop) gate on this rather than
// hasWiFi: an Ethernet-only board (the MHC-WLED P4 shield) still has UDP.
constexpr bool hasNetwork = hasWiFi || hasEthernet;

