MoonModules/projectMM/src/platform/esp32/platform_config.h
// ethPhyIsFixed, true where the interface is a property of the PLATFORM rather than of the board,
// so a persisted or catalog-supplied PHY type must not override it. False on real silicon, where
// which PHY a board carries is exactly what deviceModels.json exists to say.
//
// Set under emulation: the emulator presents one MAC and no other kind exists to select, so a saved
// ethType from an earlier session would otherwise pick hardware that is not there and leave the
// device with no network at all.
#ifdef CONFIG_ETH_USE_OPENETH
constexpr bool ethPhyIsFixed = true;
#else
constexpr bool ethPhyIsFixed = false;
#endif

// Enough compute headroom for a per-pixel FLOAT algorithm: a raymarcher, a fractal, a feedback
// loop that iterates per light. This is the ONE exception to the integer-only render-path rule in
// coding-standards, and it is gated rather than assumed: an effect behind this constant is not
// compiled at all where it is false, so no ESP32 firmware carries the float code and the rule is
// not weakened on the targets it protects.
//
// The cost is per PIXEL, not per chip, so this is a statement about the FPU rather than about
// fixture size: a target with hardware float can run such an effect on a small panel and cannot on
// a large one, and the effect's own controls are what trade quality for cost. The classic ESP32 has
// no FPU at all, so it stays out; the S3 and P4 have single-precision hardware.
// Derived from the SoC capability, not a hand-kept chip list: every ESP32 variant IDF supports
// declares SOC_CPU_HAS_FPU (checked S3, P4, S31 and the classic ESP32: all 1), so a new target
// inherits the right answer without an edit here. What separates them is SPEED and clock, which
// the effect's own `steps` control and the fixture size decide: not whether the code exists.
constexpr bool hasHeavyCompute = SOC_CPU_HAS_FPU;

// Preprocessor mirror of the flag above: a whole effect can be compiled out only by
// `#if`, which `constexpr bool` cannot drive. Keep the two in step.
#define MM_HEAVY_COMPUTE SOC_CPU_HAS_FPU

// Which Ethernet PHY *drivers* this firmware actually carries. The W5500 SPI
// driver is compiled in only on chips with no internal EMAC and the SPI-eth
// fragment (the S3: CONFIG_ETH_USE_SPI_ETHERNET set, CONFIG_ETH_USE_ESP32_EMAC
// not). NetworkModule gates the *live* W5500 reconfigure on this: on a classic /
// P4 board (RMII only) ethInit() can't bring up W5500, so the live path must not
// tear down the working RMII interface for a type it can't init. Mirrors the
// MM_ETH_W5500 marker in platform_esp32.cpp; false on desktop (no SPI-eth there).
// hasNamedNetInterfaces: false on every ESP32: one MAC per chip, so a raw sender has nothing to
// choose between and a NIC-name control would do nothing. See the desktop config for the true case.
constexpr bool hasNamedNetInterfaces = false;

// hasNdi: false on every ESP32, and not by choice: the NDI runtime is a closed binary that
// Vizrt builds only for Intel and ARM, with a documented floor of SSSE3 / NEON SIMD. Neither
// Xtensa nor ESP32 RISC-V has either, and there is no source to port. NDI's own embedded answer
// is an FPGA reference design, not an MCU. An ESP32 reaches the same tools over Art-Net, sACN and
// DDP instead: open protocols, our own implementations, send and receive. Desktop config: true.
constexpr bool hasNdi = false;

// hasHls: true only where the chip has a hardware H.264 encoder, which on the ESP32 line means
// the P4 alone (soc_caps SOC_H264_SUPPORTED). Everywhere else the encode has no hardware and
// there is no process to spawn. Mirrors the MM_HLS Kconfig symbol, which is what actually pulls
// in the esp_h264 component, so the flag and the dependency can never disagree.
#if defined(CONFIG_MM_HLS)
constexpr bool hasHls = true;
#else
constexpr bool hasHls = false;
#endif
// hasEncoderChoice: false on the P4: one hardware encoder, so there is nothing to choose and
// the control is hidden. Desktop config: true (ffmpeg offers several).
constexpr bool hasEncoderChoice = false;
// hasFsSegments: false: segments live in a PSRAM ring, not on LittleFS. At one segment per
// second the flash wear buys nothing, since a live segment is stale within seconds; the HTTP
// server serves them through the hlsSegment seam instead. Desktop config: true.
constexpr bool hasFsSegments = false;

#if defined(CONFIG_ETH_USE_SPI_ETHERNET) && !defined(CONFIG_ETH_USE_ESP32_EMAC)
constexpr bool hasEthW5500 = true;
#else
constexpr bool hasEthW5500 = false;
#endif

// Ethernet PHY type. The DRIVER for each type is compiled into the firmware per
// chip (RMII EMAC on classic/P4, W5500 SPI on the S3: see the sdkconfig
// fragments); WHICH type a given board uses, and its pins, are runtime config
// (deviceModels.json → NetworkModule → platform::setEthConfig). Plain int values keep
// this header free of esp_eth includes; ethInit() maps them to the IDF ctors.
enum EthPhyType {
    ethNone    = 0,  // no Ethernet on this board (the default: WiFi only)
    ethLan8720 = 1,  // RMII, generic PHY (Olimex Gateway, QuinLED Dig-Octa)
    ethIp101   = 2,  // RMII, IP101 PHY (Waveshare P4-NANO; managed component, P4-only)
    ethW5500   = 3,  // SPI, external W5500 module (ESP32-S3 boards: SE16, LightCrafter)
    ethYt8531  = 4,  // RGMII, YT8531 PHY (ESP32-S31 CoreBoard; on-chip 1 Gb EMAC, S31-only)
    ethOpeneth = 5,  // QEMU's emulated OpenCores MAC, no silicon, only ever selected under emulation.
                     // It is what gives an emulated device a real IP stack, and therefore the REST API
                     // and the web UI: without it a QEMU run can only be watched on the serial console.
};

// Per-board Ethernet pin/PHY map: runtime-configurable (no longer a fixed
// compile-time constant). RMII fields apply to LAN8720/IP101; the spi* fields to
// W5500. ethInit() reads the runtime `ethConfig` (set from deviceModels.json via
// platform::setEthConfig); the per-chip `ethConfigDefault` below seeds it so an
// un-provisioned board still works. -1 = "leave at IDF default / unused".
struct EthPinConfig {
    int phyType;        // EthPhyType
    int phyAddr;
    // RMII (internal EMAC):
    int mdcGpio;        // SMI clock; -1 = IDF default
    int mdioGpio;       // SMI data;  -1 = IDF default
    int rstGpio;        // PHY reset
    int rmiiClockGpio;  // RMII 50 MHz reference clock pin
    bool rmiiClockExtIn;  // true = clock IN (board feeds it), false = chip drives it OUT
    // (RMII data lines TX_EN/TXD0/TXD1/CRS_DV/RXD0/RXD1 are not configurable here:
    // fixed in silicon on the classic ESP32, and on the P4 the IDF EMAC macro already
    // defaults them to the NANO wiring (49/34/35/28/29/30). No board varies them.)
    // W5500 (external SPI MAC+PHY):
    int spiMiso;
    int spiMosi;
    int spiSck;
    int spiCs;
    int spiIrq;
};

// Per-chip default, seeding the runtime config so a board with no eth block in
// deviceModels.json still comes up on the historically-wired pins:
//  - P4 → Waveshare P4-NANO: IP101, addr 1, MDC/MDIO 31/52, reset 51, ext 50 MHz
//    clock IN on GPIO50 (Waveshare wiki + schematic + ESPHome page agree).
//  - classic ESP32 → the common LAN8720 RMII wiring: addr 0, reset 5, chip drives
//    RMII clock OUT on GPIO17, MDC/MDIO at IDF defaults (e.g. Olimex ESP32-Gateway).
//  - S3 → no built-in EMAC, so the default is W5500 SPI but with no pins set
//    (phyType ethW5500, pins -1): a W5500 S3 board MUST provide its SPI pins via
//    deviceModels.json: there's no universal S3 default to guess.
//  - S31 → Function-CoreBoard-1: RGMII YT8531, MDC/MDIO 5/6, reset 7. The RGMII
//    *data* pins (TX_CTL/TXD0-3, RX_CTL/RXD0-3, clocks) are board-fixed and live in
//    ethInitEmac()'s S31 branch, not this struct (same reason RMII data pins don't -
//    see above); rmiiClock* are unused for RGMII (clocks are set there too). See
//    docs/reference/esp32-s31-coreboard.md for the schematic pin map.
constexpr EthPinConfig ethConfigDefault =
#ifdef CONFIG_ETH_USE_OPENETH
    // Under emulation the interface is QEMU's MAC, whatever chip is being emulated. It has no pins
    // and no PHY to address, so every field below is -1: ethInitOpeneth ignores them. This is a
    // COMPILE-time branch because CONFIG_ETH_USE_OPENETH is only ever set by the qemu firmware ,
    // there is no silicon that carries it, so no real board can take this path.
    EthPinConfig{ /*phyType*/ ethOpeneth, /*addr*/ 1, /*mdc*/ -1, /*mdio*/ -1,
                  /*rst*/ -1, /*rmiiClk*/ -1, /*extIn*/ false,
                  /*miso*/ -1, /*mosi*/ -1, /*sck*/ -1, /*cs*/ -1, /*irq*/ -1 };
#else
    isEsp32P4   ? EthPinConfig{ /*phyType*/ ethIp101, /*addr*/ 1, /*mdc*/ 31, /*mdio*/ 52,
                                /*rst*/ 51, /*rmiiClk*/ 50, /*extIn*/ true,
                                /*miso*/ -1, /*mosi*/ -1, /*sck*/ -1, /*cs*/ -1, /*irq*/ -1 }
  : isEsp32S31  ? EthPinConfig{ /*phyType*/ ethYt8531, /*addr*/ -1, /*mdc*/ 5, /*mdio*/ 6,
                                /*rst*/ 7, /*rmiiClk*/ -1, /*extIn*/ false,
                                /*miso*/ -1, /*mosi*/ -1, /*sck*/ -1, /*cs*/ -1, /*irq*/ -1 }
  : isEsp32S3   ? EthPinConfig{ /*phyType*/ ethW5500, /*addr*/ 1, /*mdc*/ -1, /*mdio*/ -1,
                                /*rst*/ -1, /*rmiiClk*/ -1, /*extIn*/ false,
                                /*miso*/ -1, /*mosi*/ -1, /*sck*/ -1, /*cs*/ -1, /*irq*/ -1 }
    // Classic ESP32: MDC 23 / MDIO 18 stated rather than left at -1. The MAC uses these either way
    // (a -1 makes ethInitEmac skip smi_gpio, and IDF's own ETH_ESP32_EMAC_DEFAULT_CONFIG applies the
    // same pair), but a -1 is invisible to the pin map, which reads the controls: two pins the MAC
    // drives showed as free, and nothing would have flagged an LED lane taking one.
              :   EthPinConfig{ /*phyType*/ ethLan8720, /*addr*/ 0, /*mdc*/ 23, /*mdio*/ 18,
                                /*rst*/ 5, /*rmiiClk*/ 17, /*extIn*/ false,
                                /*miso*/ -1, /*mosi*/ -1, /*sck*/ -1, /*cs*/ -1, /*irq*/ -1 };
#endif  // CONFIG_ETH_USE_OPENETH

// OTA (esp_https_ota) is available on every ESP32 build: the OTA partition
// layout in partitions/*.csv reserves app0/app1 unconditionally, and esp_https_ota
// is in baseline ESP-IDF. FirmwareUpdateModule + the /api/firmware/url route
// `if constexpr` on this so desktop builds get a 501-returning stub instead.
constexpr bool hasOta = true;

// Improv-serial is the device's serial RPC channel (UART0 + native USB-Serial-JTAG):
// the WiFi-provisioning RPCs (WIFI_SETTINGS, GET_WIFI_NETWORKS) AND the vendor RPCs
// (SET_TX_POWER, APPLY_OP: "Improv = REST over serial"). The
// transport is always available on ESP32, so the listener runs everywhere: including
// Ethernet-only builds (`--firmware esp32-eth*`), where the WiFi-only RPCs are compiled
// out (the `esp_wifi_*` calls aren't linked) but the vendor RPCs still work, so the web
// installer can push a device-model's config over serial to an eth device just as it
// does to a WiFi one. `hasImprov` is therefore true on every ESP32 target; only desktop
// (no serial peripheral) leaves it false.
constexpr bool hasImprov = true;

} // namespace mm::platform

// MM_MOONLIVE_HAS_HOST_JIT: always 0 on ESP32. The unit tests that consume this macro run on
// the *desktop* host binary; on-device MoonLive uses its own per-ISA backends (Xtensa / RISC-V
// in src/platform/esp32/moonlive_emit.cpp), validated by the live hardware run, not host tests.
// Kept in platform_config.h so the core header stays free of architecture #ifs.
#define MM_MOONLIVE_HAS_HOST_JIT 0

// MM_LINKS_ALL_LED_DRIVERS: 0 on ESP32: a board links only the drivers its silicon can run, so
// the type picker stays honest and the binary lean. See the desktop config for why the host is
// the other way round.
#define MM_LINKS_ALL_LED_DRIVERS 0
